"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№2).py
Автор: 2020 © А.И.Бизяева, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 11/11/2020
Дата последней модификации: 11/11/2020
Связанные файлы/пакеты: min,max
Описание: Решение задачи №№ 2
#версия Python: 3.8
"""

"""
Нарисуйте блок-схему к следующей задаче: Преобразовать дату в "компьютерном" представлении (системную дату) в "российский" формат, т.е. день/месяц/год (например, 17/05/2009).
"""

A=2.0
B=8.
C=6.12

print(max(A,B,C))
print(min(A,B,C))
