"" "
Имя проекта: Practicum-1
Номер версии: 1.0
Имя файла: Practicum-1 (№21) .py
Автор: 2020 © А.И.Бизяева, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 9.12.2020
Дата последней модификации: 9.12.2020
Описание: Решение задачи № 21
# версия Python: 3.8
"" "
Определить значение функции Z=1/X*Y при производных X и Y.
""
X=int(input("Введите X:"))
Y=int(input("Введите Y:"))
Z=1/X*Y
print("Значение ф-ии равно",Z)
