"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№5).py
Автор: 2020 © А.И.Бизяева, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 11/11/2020
Дата последней модификации: 11/11/2020
Связанные файлы/пакеты: 
Описание: Решение задачи № 5
#версия Python:3.8
"""
Определить значение функции Z=1/(XY) при X и Y не равных 0.
""

X=1
Y=0
if X!=0 and Y!=0 :
    Z=1/(X*Y)
    print(Z)
else:
    print("Неопределенность")
